aaron-bond.better-comments
davidanson.vscode-markdownlint
dbaeumer.vscode-eslint
eamodio.gitlens
editorconfig.editorconfig
esbenp.prettier-vscode
formulahendry.code-runner
github.codespaces
github.github-vscode-theme
github.remotehub
github.vscode-pull-request-github
jeff-hykin.better-shellscript-syntax
lumirelle.shell-format-rev
mads-hartmann.bash-ide-vscode
mechatroner.rainbow-csv
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-python.debugpy
ms-python.python
ms-python.vscode-python-envs
ms-vscode.azure-repos
ms-vscode.makefile-tools
ms-vscode.powershell
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-wsl
ms-vscode.remote-repositories
ms-vscode.ts-customized-language-service
ms-vscode.vscode-github-issue-notebooks
redhat.vscode-xml
redhat.vscode-yaml
rogalmic.bash-debug
rust-lang.rust-analyzer
streetsidesoftware.code-spell-checker
sumneko.lua
timonwong.shellcheck
typescriptteam.native-preview
vadimcn.vscode-lldb